wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/Implantable MA - iis3dwb/iis3dwb_reg.h
typedef enum {
  IIS3DWB_2g   = 0,
  IIS3DWB_16g  = 1, /* if XL_FS_MODE = â€â€-> IIS3DWB_2g */
  IIS3DWB_4g   = 2,
  IIS3DWB_8g   = 3,
} iis3dwb_fs_xl_t;
int32_t iis3dwb_xl_full_scale_set(stmdev_ctx_t *ctx, iis3dwb_fs_xl_t val);
int32_t iis3dwb_xl_full_scale_get(stmdev_ctx_t *ctx, iis3dwb_fs_xl_t *val);

typedef enum {
  IIS3DWB_XL_ODR_OFF    = 0,
  IIS3DWB_XL_ODR_26k7Hz = 5,
} iis3dwb_odr_xl_t;
int32_t iis3dwb_xl_data_rate_set(stmdev_ctx_t *ctx, iis3dwb_odr_xl_t val);
int32_t iis3dwb_xl_data_rate_get(stmdev_ctx_t *ctx, iis3dwb_odr_xl_t *val);

int32_t iis3dwb_block_data_update_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_block_data_update_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS3DWB_LSb_1mg  = 0,
  IIS3DWB_LSb_16mg = 1,
} iis3dwb_usr_off_w_t;
int32_t iis3dwb_xl_offset_weight_set(stmdev_ctx_t *ctx,
                                     iis3dwb_usr_off_w_t val);
int32_t iis3dwb_xl_offset_weight_get(stmdev_ctx_t *ctx,
                                     iis3dwb_usr_off_w_t *val);

typedef enum {
  IIS3DWB_ENABLE_ALL  = 0,
  IIS3DWB_ONLY_X_ON_ONE_OUT_REG      = 0x01,
  IIS3DWB_ONLY_Y_ON_ONE_OUT_REG      = 0x02,
  IIS3DWB_ONLY_Z_ON_ONE_OUT_REG      = 0x03,
  IIS3DWB_ONLY_X_ON_ALL_OUT_REG      = 0x11,
  IIS3DWB_ONLY_Y_ON_ALL_OUT_REG      = 0x12,
  IIS3DWB_ONLY_Z_ON_ALL_OUT_REG      = 0x13,
} iis3dwb_xl_axis_sel_t;
int32_t iis3dwb_xl_axis_selection_set(stmdev_ctx_t *ctx,
                                      iis3dwb_xl_axis_sel_t val);
int32_t iis3dwb_xl_axis_selection_get(stmdev_ctx_t *ctx,
                                      iis3dwb_xl_axis_sel_t *val);

typedef struct {
  iis3dwb_all_int_src_t       all_int_src;
  iis3dwb_wake_up_src_t       wake_up_src;
  iis3dwb_status_reg_t        status_reg;
  } iis3dwb_all_sources_t;
int32_t iis3dwb_all_sources_get(stmdev_ctx_t *ctx,
                                iis3dwb_all_sources_t *val);

int32_t iis3dwb_status_reg_get(stmdev_ctx_t *ctx,
                               iis3dwb_status_reg_t *val);

int32_t iis3dwb_xl_flag_data_ready_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_temp_flag_data_ready_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_xl_usr_offset_x_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t iis3dwb_xl_usr_offset_x_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis3dwb_xl_usr_offset_y_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t iis3dwb_xl_usr_offset_y_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis3dwb_xl_usr_offset_z_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t iis3dwb_xl_usr_offset_z_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis3dwb_xl_usr_offset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_xl_usr_offset_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_timestamp_rst(stmdev_ctx_t *ctx);

int32_t iis3dwb_timestamp_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_timestamp_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_timestamp_raw_get(stmdev_ctx_t *ctx, uint8_t *buff);

typedef enum {
  IIS3DWB_NO_ROUND      = 0,
  IIS3DWB_ROUND         = 1,
} iis3dwb_rounding_t;
int32_t iis3dwb_rounding_mode_set(stmdev_ctx_t *ctx,
                                  iis3dwb_rounding_t val);
int32_t iis3dwb_rounding_mode_get(stmdev_ctx_t *ctx,
                                  iis3dwb_rounding_t *val);

int32_t iis3dwb_temperature_raw_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis3dwb_acceleration_raw_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis3dwb_fifo_out_raw_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis3dwb_odr_cal_reg_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_odr_cal_reg_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS3DWB_DRDY_LATCHED = 0,
  IIS3DWB_DRDY_PULSED  = 1,
} iis3dwb_dataready_pulsed_t;
int32_t iis3dwb_data_ready_mode_set(stmdev_ctx_t *ctx,
                                    iis3dwb_dataready_pulsed_t val);
int32_t iis3dwb_data_ready_mode_get(stmdev_ctx_t *ctx,
                                    iis3dwb_dataready_pulsed_t *val);

int32_t iis3dwb_device_id_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis3dwb_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_auto_increment_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_auto_increment_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_boot_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_boot_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS3DWB_XL_ST_DISABLE  = 0,
  IIS3DWB_XL_ST_POSITIVE = 1,
  IIS3DWB_XL_ST_NEGATIVE = 2,
} iis3dwb_st_xl_t;
int32_t iis3dwb_xl_self_test_set(stmdev_ctx_t *ctx, iis3dwb_st_xl_t val);
int32_t iis3dwb_xl_self_test_get(stmdev_ctx_t *ctx, iis3dwb_st_xl_t *val);

int32_t iis3dwb_xl_filter_lp2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_xl_filter_lp2_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_filter_settling_mask_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t iis3dwb_filter_settling_mask_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

typedef enum {
  IIS3DWB_SLOPE_ODR_DIV_4           = 0x30,
  IIS3DWB_HP_ODR_DIV_10             = 0x11,
  IIS3DWB_HP_ODR_DIV_20             = 0x12,
  IIS3DWB_HP_ODR_DIV_45             = 0x13,
  IIS3DWB_HP_ODR_DIV_100            = 0x14,
  IIS3DWB_HP_ODR_DIV_200            = 0x15,
  IIS3DWB_HP_ODR_DIV_400            = 0x16,
  IIS3DWB_HP_ODR_DIV_800            = 0x17,
  IIS3DWB_LP_6k3Hz                  = 0x00,
  IIS3DWB_LP_ODR_DIV_4              = 0x80,
  IIS3DWB_LP_ODR_DIV_10             = 0x81,
  IIS3DWB_LP_ODR_DIV_20             = 0x82,
  IIS3DWB_LP_ODR_DIV_45             = 0x83,
  IIS3DWB_LP_ODR_DIV_100            = 0x84,
  IIS3DWB_LP_ODR_DIV_200            = 0x85,
  IIS3DWB_LP_ODR_DIV_400            = 0x86,
  IIS3DWB_LP_ODR_DIV_800            = 0x87,
} iis3dwb_hp_slope_xl_en_t;
int32_t iis3dwb_xl_hp_path_on_out_set(stmdev_ctx_t *ctx,
                                      iis3dwb_hp_slope_xl_en_t val);
int32_t iis3dwb_xl_hp_path_on_out_get(stmdev_ctx_t *ctx,
                                      iis3dwb_hp_slope_xl_en_t *val);

int32_t iis3dwb_xl_fast_settling_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_xl_fast_settling_get(stmdev_ctx_t *ctx, uint8_t *val);

