wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/Implantable MA - iis3dwb/iis3dwb_reg.h
typedef enum {
  IIS3DWB_USE_SLOPE = 0,
  IIS3DWB_USE_HPF   = 1,
} iis3dwb_slope_fds_t;
int32_t iis3dwb_xl_hp_path_internal_set(stmdev_ctx_t *ctx,
                                        iis3dwb_slope_fds_t val);
int32_t iis3dwb_xl_hp_path_internal_get(stmdev_ctx_t *ctx,
                                        iis3dwb_slope_fds_t *val);

typedef enum {
  IIS3DWB_PULL_UP_DISC       = 0,
  IIS3DWB_PULL_UP_CONNECT    = 1,
} iis3dwb_sdo_pu_en_t;
int32_t iis3dwb_sdo_sa0_mode_set(stmdev_ctx_t *ctx, iis3dwb_sdo_pu_en_t val);
int32_t iis3dwb_sdo_sa0_mode_get(stmdev_ctx_t *ctx, iis3dwb_sdo_pu_en_t *val);

typedef enum {
  IIS3DWB_SPI_4_WIRE = 0,
  IIS3DWB_SPI_3_WIRE = 1,
} iis3dwb_sim_t;
int32_t iis3dwb_spi_mode_set(stmdev_ctx_t *ctx, iis3dwb_sim_t val);
int32_t iis3dwb_spi_mode_get(stmdev_ctx_t *ctx, iis3dwb_sim_t *val);

typedef enum {
  IIS3DWB_I2C_ENABLE  = 0,
  IIS3DWB_I2C_DISABLE = 1,
} iis3dwb_i2c_disable_t;
int32_t iis3dwb_i2c_interface_set(stmdev_ctx_t *ctx,
                                  iis3dwb_i2c_disable_t val);
int32_t iis3dwb_i2c_interface_get(stmdev_ctx_t *ctx,
                                  iis3dwb_i2c_disable_t *val);

typedef struct {
  uint8_t drdy_xl       : 1; /* Accelerometer data ready */
  uint8_t boot          : 1; /* Restoring calibration parameters */
  uint8_t fifo_th       : 1; /* FIFO threshold reached */
  uint8_t fifo_ovr      : 1; /* FIFO overrun */
  uint8_t fifo_full     : 1; /* FIFO full */
  uint8_t fifo_bdr      : 1; /* FIFO Batch counter threshold reached */
  uint8_t wake_up       : 1; /* wake up event */
  uint8_t sleep_change  : 1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t sleep_status  : 1; /* Act/Inact status */
} iis3dwb_pin_int1_route_t;
int32_t iis3dwb_pin_int1_route_set(stmdev_ctx_t *ctx,
                                   iis3dwb_pin_int1_route_t *val);
int32_t iis3dwb_pin_int1_route_get(stmdev_ctx_t *ctx,
                                   iis3dwb_pin_int1_route_t *val);

typedef struct {
  uint8_t drdy_xl       : 1; /* Accelerometer data ready */
  uint8_t drdy_temp     : 1; /* Temperature data ready */
  uint8_t fifo_th       : 1; /* FIFO threshold reached */
  uint8_t fifo_ovr      : 1; /* FIFO overrun */
  uint8_t fifo_full     : 1; /* FIFO full */
  uint8_t fifo_bdr      : 1; /* FIFO Batch counter threshold reached */
  uint8_t timestamp     : 1; /* timestamp overflow */
  uint8_t wake_up       : 1; /* wake up event */
  uint8_t sleep_change  : 1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t sleep_status  : 1; /* Act/Inact status */
} iis3dwb_pin_int2_route_t;
int32_t iis3dwb_pin_int2_route_set(stmdev_ctx_t *ctx,
                                   iis3dwb_pin_int2_route_t *val);
int32_t iis3dwb_pin_int2_route_get(stmdev_ctx_t *ctx,
                                   iis3dwb_pin_int2_route_t *val);

typedef enum {
  IIS3DWB_PUSH_PULL   = 0,
  IIS3DWB_OPEN_DRAIN  = 1,
} iis3dwb_pp_od_t;
int32_t iis3dwb_pin_mode_set(stmdev_ctx_t *ctx, iis3dwb_pp_od_t val);
int32_t iis3dwb_pin_mode_get(stmdev_ctx_t *ctx, iis3dwb_pp_od_t *val);

typedef enum {
  IIS3DWB_ACTIVE_HIGH = 0,
  IIS3DWB_ACTIVE_LOW  = 1,
} iis3dwb_h_lactive_t;
int32_t iis3dwb_pin_polarity_set(stmdev_ctx_t *ctx, iis3dwb_h_lactive_t val);
int32_t iis3dwb_pin_polarity_get(stmdev_ctx_t *ctx, iis3dwb_h_lactive_t *val);

int32_t iis3dwb_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS3DWB_INT_PULSED            = 0,
  IIS3DWB_INT_LATCHED           = 1,
} iis3dwb_lir_t;
int32_t iis3dwb_int_notification_set(stmdev_ctx_t *ctx, iis3dwb_lir_t val);
int32_t iis3dwb_int_notification_get(stmdev_ctx_t *ctx, iis3dwb_lir_t *val);

typedef enum {
  IIS3DWB_LSb_FS_DIV_64       = 0,
  IIS3DWB_LSb_FS_DIV_256      = 1,
} iis3dwb_wake_ths_w_t;
int32_t iis3dwb_wkup_ths_weight_set(stmdev_ctx_t *ctx,
                                    iis3dwb_wake_ths_w_t val);
int32_t iis3dwb_wkup_ths_weight_get(stmdev_ctx_t *ctx,
                                    iis3dwb_wake_ths_w_t *val);

int32_t iis3dwb_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_xl_usr_offset_on_wkup_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_xl_usr_offset_on_wkup_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_wkup_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_wkup_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_fifo_watermark_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t iis3dwb_fifo_watermark_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t iis3dwb_fifo_stop_on_wtm_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_fifo_stop_on_wtm_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS3DWB_XL_NOT_BATCHED          =  0,
  IIS3DWB_XL_BATCHED_AT_26k7Hz    = 10,
} iis3dwb_bdr_xl_t;
int32_t iis3dwb_fifo_xl_batch_set(stmdev_ctx_t *ctx, iis3dwb_bdr_xl_t val);
int32_t iis3dwb_fifo_xl_batch_get(stmdev_ctx_t *ctx, iis3dwb_bdr_xl_t *val);

typedef enum {
  IIS3DWB_BYPASS_MODE             = 0,
  IIS3DWB_FIFO_MODE               = 1,
  IIS3DWB_STREAM_TO_FIFO_MODE     = 3,
  IIS3DWB_BYPASS_TO_STREAM_MODE   = 4,
  IIS3DWB_STREAM_MODE             = 6,
  IIS3DWB_BYPASS_TO_FIFO_MODE     = 7,
} iis3dwb_fifo_mode_t;
int32_t iis3dwb_fifo_mode_set(stmdev_ctx_t *ctx, iis3dwb_fifo_mode_t val);
int32_t iis3dwb_fifo_mode_get(stmdev_ctx_t *ctx, iis3dwb_fifo_mode_t *val);

typedef enum {
  IIS3DWB_TEMP_NOT_BATCHED        = 0,
  IIS3DWB_TEMP_BATCHED_AT_104Hz   = 3,
} iis3dwb_odr_t_batch_t;
int32_t iis3dwb_fifo_temp_batch_set(stmdev_ctx_t *ctx,
                                    iis3dwb_odr_t_batch_t val);
int32_t iis3dwb_fifo_temp_batch_get(stmdev_ctx_t *ctx,
                                    iis3dwb_odr_t_batch_t *val);

typedef enum {
  IIS3DWB_NO_DECIMATION = 0,
  IIS3DWB_DEC_1         = 1,
  IIS3DWB_DEC_8         = 2,
  IIS3DWB_DEC_32        = 3,
} iis3dwb_odr_ts_batch_t;
int32_t iis3dwb_fifo_timestamp_decimation_set(stmdev_ctx_t *ctx,
                                              iis3dwb_odr_ts_batch_t val);
int32_t iis3dwb_fifo_timestamp_decimation_get(stmdev_ctx_t *ctx,
                                              iis3dwb_odr_ts_batch_t *val);

int32_t iis3dwb_rst_batch_counter_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_rst_batch_counter_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_batch_counter_threshold_set(stmdev_ctx_t *ctx,
                                            uint16_t val);
int32_t iis3dwb_batch_counter_threshold_get(stmdev_ctx_t *ctx,
                                            uint16_t *val);

int32_t iis3dwb_fifo_data_level_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t iis3dwb_fifo_status_get(stmdev_ctx_t *ctx,
                                iis3dwb_fifo_status2_t *val);

int32_t iis3dwb_fifo_full_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_fifo_ovr_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS3DWB_XL_TAG = 2,
  IIS3DWB_TEMPERATURE_TAG,
  IIS3DWB_TIMESTAMP_TAG,
} iis3dwb_fifo_tag_t;
int32_t iis3dwb_fifo_sensor_tag_get(stmdev_ctx_t *ctx,
				                    iis3dwb_fifo_tag_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* IIS3DWB_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
